cask_args appdir: '/Applications'

# Core CLI tools
brew 'coreutils'
brew 'git'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'wget'
brew 'zsh'

# Modern search, navigation, and productivity
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'ripgrep'
brew 'starship'
brew 'stow'
brew 'yt-dlp'
brew 'zoxide'

# GitHub CLI
brew 'gh'

# AI coding agent
brew 'opencode'

# Mac App Store CLI
brew 'mas'

# Casks (GUI applications)
cask '1password'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'vlc'
